---
type: PipeFittingAndAccessoryPressureDropUIData
namespace: Autodesk.Revit.UI.Plumbing
version: 2024
members: 4
tags: [revit-api, class]
---

# PipeFittingAndAccessoryPressureDropUIData

`Autodesk.Revit.UI.Plumbing.PipeFittingAndAccessoryPressureDropUIData` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetUIDataItems | 2014 | `public IList < PipeFittingAndAccessoryPressureDropUIDataItem > GetUIDataItems ()` |
| Method | GetUnits | 2014 | `public Units GetUnits ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |